---
type: StructuralSectionRound
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 4
tags: [revit-api, class]
---

# StructuralSectionRound

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CentroidHorizontal | 2015 | `public double CentroidHorizontal { get ; set ; }` |
| Property | CentroidVertical | 2015 | `public double CentroidVertical { get ; set ; }` |
| Property | Diameter | 2015 | `public double Diameter { get ; set ; }` |
| Property | NameKey | 2015 | `public string NameKey { get ; set ; }` |